Catalogs/СоглашенияСтрахования.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<Catalog>
		<Properties>
			<Name>СоглашенияСтрахования</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.Контрагенты</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Прейскурант</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Прейскуранты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерДоговора</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>омг_ВидДоговораНДС</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.омг_ВидДоговораНДС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>омг_Менеджер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/СоглашенияСтрахования/Forms/ФормаЭлемента/Ext/Form/Module.bsl
#Область ОбработчикиСобытий

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	////////////////////////////////////////////////////
	// ОМГ  
	
	
	Если Параметры.Свойство("Владелец") Тогда 
		Объект.Владелец = Параметры.Владелец;
	КонецЕсли; 
	
	НовыйЭлемент = ЭтаФорма.Элементы.Добавить("СтавкаНДС", Тип("ПолеФормы"),Элементы.ДанныеДоговора);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "Объект.омг_ВидДоговораНДС";   
	
	НовыйЭлемент = ЭтаФорма.Элементы.Добавить("омг_Менеджер", Тип("ПолеФормы"),Элементы.ДанныеДоговора);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "Объект.омг_Менеджер";
	НовыйЭлемент.ТолькоПросмотр = Истина;
	
	//Если РольДоступна("омг_ДобавлениеРедактированиеДоговоров") Тогда
	//	 НовыйЭлемент.ТолькоПросмотр = Ложь
	//КонецЕсли;
	
	Если РольДоступна("омг_ДобавлениеРедактированиеДоговоров") или РольДоступна("ПолныеПрава") Тогда
		
		НовыйЭлемент.ТолькоПросмотр = Ложь
		
	иначе
		
		Если Объект.Ссылка.Пустая() Тогда
			Отказ = Истина
		иначе
			ЭтаФорма.ТолькоПросмотр = Истина
		КонецЕсли;          
		
	КонецЕсли;

	// ОМГ
    ////////////////////////////////////////////////////
	
	Если Объект.Ссылка.Пустая()
		И Не ЗначениеЗаполнено(Объект.Организация)
	Тогда
		Объект.Организация = Справочники.Организации.ЕдинственнаяОрганизация();
		Если Не ЗначениеЗаполнено(Объект.Организация) Тогда
			Объект.Организация = Справочники.Организации.ОрганизацияПоУмолчанию();
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры 

#КонецОбласти
